export const BG_LOCALE = {
  title: "ScanSight",
  login: "Вход",
  register: "Регистрация",
  password: "Парола",
  confirmPassword: "Потвърди Паролата",
  email: "Имейл Адрес",
  firstName: "Име",
  lastName: "Фамилия",
  phonerNumber: "Тел. Номер",
  termsOfUse:
    "Потвърждавам, че съм съгласен(а) с условията за ползване на ScanSight и политиката за поверителност.",
  haveAccount: "Имате акаунт?",
  noAccount: "Нямате акаунт?",
  loginHere: "Влезте от тук",
  registerHere: "Регистрирайте се тук",
  readMoreText: "Прочети повече",
  profileText: "Профил",
  signout: "Излез",
  phoneNumber: "Тел. Номер",
  hero: {
    text1:
      " е софтуер, който предоставя на своите потребители възможността да сканира предварително обозначени QR кодове. Тези стикери и табели са позиционирани на различни туристически обекти в региона, като всеки сканиран QR код носи определен брой точки в акаунта на своя потребител.",
    text2:
      "Целта на приложението е да мотивира туристическата активност в региона, като направи преживяването на потребителите интересно и забавно.",
    text3:
      "Софтуерът е обвързан с Община Петрич и предоставя уникалната възможност за печалба на различни награди, които отговарят на събраният брой точки от потребителя. За повече информация относно точковата система и наградите може да прочетете ",
    text4:
      "Екипът на ‘ScanSight’ и Община Петрич Ви пожелава успех и приятна игра!",
    here: "тук",
  },
  sightseeing: {
    title: "Сканирай Туристически Обект",
    button: "СКАНИРАЙ QR",
    rulesPrizes: {
      title: "Точки и Награди",
      points: "Точки",
      pointsListItem1:
        "Всеки посетен туристически обект, който има стикер с логото на ‘ScanSight’ в Община Петрич носи 5 точки в акаунта на своя потребител.",
      pointsListItem2:
        "Местата за посещение, които влизат в графа туристически обекти са следните: Хераклея Синтика, Къща Ванга, Исторически музей Петрич и Самуилова Крепост.",
      pointsListItem3:
        "Всеки посетен обект от секция хобита и свободно време, който има стикер с логото на 'ScanSight' в Община Петрич носи 3 точки в акаунта на своя потребител.",
      pointsListItem4:
        "Местата за посещение, които влизат в графа хобита и свободно време са следните: кино, билярд клуб",
      prizes: "Награди",
      prizesListItem1:
        "20 събрани точки отговарят на Сертификат за Турист на Годината .",
      prizesListItem2:
        "50 събрани точки отговарят на предметна награда тениска, шапка или изненада предоставена от Община Петрич.",
    },
  },
  readMore: {
    title: "Прочетете Повече",
    herecleqSintica: {
      title:
        "Светлината на историческите битки, огледалото на тракийското величие.",
      workTime: "Всеки ден от 09:00 до 20:00 ч.",
      text1:
        "Античен град Хераклея Синтика е сред най-значимите археологически обекти в България. Градът съществува близо 1000 години, от IVв.пр.Хр. до VIв.сл.Хр., като през това време населението и управниците му са проявявали завидна адаптивност в динамичната и често променяща се през вековете политическа и икономическа картина.",
      text2:
        "Близо 100 години учените спорят къде се намира той. Очакванията били да се локализира в Р.Гърция, в подножието на планината Рупел (дн.Беласица), както споменават древните автори. Латински надпис на император Галерий от 308г., заловен при полицейска акция срещу иманяри през 2002г., и проучен и публикуван от доц.Георги Митрев., показва категорично, че Хераклея лежи край Петрич, в местността „Рупите“.",
      text3:
        "Градът носи името на митичния герой Херакъл (Херкулес), който се смята за родоначалник на македонската династия на Аргеадите. Те го основават през ІV в. пр. Хр. в племенната територия на траките-синти. Хераклея Синтика се превръща в стратегически център в североизточните предели на древното македонско царство. По време на управлението на Филип II Македонски, Хераклея се превръща в една от македонските кралски резиденции. Оттук започват и първите военни кампании на Александър Велики. Именно от Хераклея той потегля на поход срещу съседни тракийски племена преди да завоюва огромната Персийска империя.",
      text4:
        "През 148г.пр.Хр. Хераклея Синтика е присъединен към провинция Македония в рамките на Римската империя. Градът е покровителстван от самия Октавиан Август – основателят на Римската империя. Именно по време на римския си период, II – IIIв.сл.Хр., Хераклея Синтика изживява своя най-голям разцвет. Изключителната, като мащаб, качества и художествена стойност, архитектура на централната градска част свидетелства за просперитета на града.",
      text5:
        "Огромен римски форум, построен върху старата агора, раннохристиянска базилика, гражданска базилика, жилищен и занаятчийски квартал, 15 верижни сакрални помещения, едно от които се смята за светилище на Немезида и най-вече сложната система от отводнителни канали, будят възхищение със своя разкош и прецизност на изпълнението, запазили се и до днес.",
      text6:
        "Театралните маски, търговски принадлежности и наличието на множество монети от цял свят, са поредното доказателство за богатия културен и социално – икономически живот, кипял в Хераклея Синтика.",
      text7:
        "Две силни земетресения през ІV-V век разрушават столицата на Средна Струма, а жителите му продължават да живеят до края на VІ в. сл. Хр. на неговия Акропол, разположен върху южния връх на хълма Кожух.",
      text8:
        "Дебелите пластове руини и тонове свлечена от хълма „Кожух“ пръст пазят Хераклея през следващите 1500 години.",
      text9:
        "Днес, и археолози, и туристи са смаяни от отлично съхранените структури, които посетителят може да види в автентичен вид с прецизна консервация. Теренните проучвания продължават и пред очите на посетителя Хераклея Синтика продължава да разкрива тайните си.",
    },
    houseVanga: {
      title:
        "Вратата към мистериите на миналото, прозорец към необятния свят на бъдещето.",
      workTime: "Всеки ден от 10:00 до 17:00 ч.",
      text1:
        "Музейната експозиция включва лични вещи, предмети, подаръци, които Ванга е получавала от благодарни хора. Всички помещения, съхранили духа на пророчицата, са запазили своята автентичност.",
      text2:
        "На първия етаж са молитвената стая и кухнята, а вдясно, след зимната градина, е стаята, в която Ванга е приемала своите посетители.",
      text3:
        "На втория етаж се намират гостната, Белият салон, спалнята и остъклената тераса, която е служила за отдих на пророчицата.",
      text4:
        "Заповядайте в Къща Ванга, за да усетите завладяващата атмосфера в скромния дом на една велика българка!",
      text5:
        "Вангелия Гущерова е родена през 1911 г. Вследствие на внезапната буря, на 12-годишна възраст тя остава сляпа завинаги.",
      text6:
        "Постепенно започват да се проявяват нейните пророчески способности. Става известна през годините на Втората световна война. Отчаяни хора, загубили връзка с близките си, отивали при Ванга с надеждата да ги успокои или да посочи лобните им места. Хиляди хора идвали при Ванга със своята болка и си тръгвали с надежда. Често са я посещавали различни държавници, културни и спортни дейци.",
      text7:
        "Днес Къща Ванга е една от основните забележителности в центъра на града – обект към Исторически музей Петрич. Къщата на българската пророчица се радва на посетители от цял свят.",
      text8:
        "Семейната къща на Ванга отваря врати за посетители на 5 май 2008 г.",
    },
    historicalMuseum: {
      title: "Преживей миналото, обогати състоянието на настоящето",
      workTime: "Понеделник – Неделя, от 09:00 до 18:00 ч.",
      text1:
        "Новият дом на Исторически музей Петрич е сред най-значимите сгради, проектирани и предвидени за нуждите на музейното дело, строени в последното десетилетие в България. От месец май 2022 г. е отворен за посетители.",
      text2:
        "На площ от над 1 800 кв.м. се съхранява и експонира културно – историческото наследство на Петрич и района.",
      text3:
        "Трансформираното градско пространство на стари казарми в центъра на Петрич се превърнаха в нов градски парк, а сред него - стара девоенизирана сграда се преобрази в новия дом на Исторически музей Петрич. С модерна архитектура в индустриален стил, преобразяващи се зелени фасади и атрактивно околно пространство, сградата отговаря на всички принципи на новия Европейски Баухаус.",
      text4:
        "Чрез похватите на съвременната музеология са представени най-ценните експонати от фондовете на музея. Експозициите и изложбите са подредени в три основни направления Археология, История и Етнография. Отвореното експозиционно пространство позволява плавно преминаване между различните теми, свързани с различните периоди от развитието на Петрич и региона.",
      text5:
        "Предвидена е зала за временни изложби, която дава възможност за представяне на гостуващи изложби",
      text6:
        "В музея функционира и Музейна работилница със свободен достъп за деца и ученици, организирани и свободни посещения с предварително записване.",
    },
    samuilFortress: {
      title: "Крепост на непоклатимата воля, свидетел на славното минало.",
      text1:
        "На територията на Национален парк-музей „Самуилова крепост” Вие ще можете да видите:",
      list1:
        "Мемориалната скулптурна композиция с 5-метрова бронзова фигура на българския цар Самуил, дело на Борис Гондов.",
      list2: "Интерактивна експозиционна зала;",
      list3:
        "Възстановка на две средновековни землянки с вътрешен проход помежду им, която дава визуална представа за тогавашните строителни традиции;",
      list4:
        "Очертания на землянки от средновековно селище, голяма землянка на цар Самуил",
      list5:
        "Зидове от отбранителната система и каменни основи на голяма наблюдателна кула, разположени в най-високата част на хълма",
      text2:
        "Разположен върху останките от средновековно укрепително съоръжение от времето на цар Самуил, в живописната долина на р.Струмешница, мемориалния комплекс представлява място за почит и преклонение към героизма и величието на Цар Самуил и неговите войни.",
      text3:
        "Самуиловата крепост - дема е средновековно укрепление, построено в периода 1009 - 1013г. по време на управлението на българския цар Самуил. Разположена е на хълм в тясната клисура между планините Беласица и Огражден, на южния бряг на река Струмешница и на 5 км северно от с. Ключ.",
      text4:
        "Именно по поречието на р. Струма византийците нахлували най-често, затова било необходимо да се изгради мащабна отбранителна система, която оптимално да използва възможностите за защита на природния релеф. Укреплението представлявало 8-километрова защитна стена, започваща от полите на Беласица планина и стигащa до подножието на Огражден. При изграждането на укреплението са демонстрирани в голяма степен старобългарските строителни традиции, като най-характерен елемент са валовете и рововете. Укреплението било защитено от три вала и два рова, разположени концентрично, следите от които се различават и до днес.",
      text5:
        "На 29 юли 1014 г. се състояло решителното сражение в Ключката клисура. Прегражденията били разрушени, а българските отряди в района на демата били пленени, След тези събития продължило настъплението на византийската войска към вътрешността на България.Неочакваният отпор на българите завършил със смъртта на най-добрия военачалник на Василий II. Това предизвикало гнева на императора и той наредил пленените 14 000 български войници да бъдат ослепени, като на всеки 100 души оставил по един едноок, за да ги води.",
      text6:
        "Трагичната съдба на българските пленници довела до смъртта на цар Самуил на 6 октомври 1014 г. Така битката при Ключката клисура се оказала решаваща за завладяването на българската държава.",
    },
  },
  profile: {
    title: "Вашият Профил",
    back: "Назад",
    home: "Начало",
    profile: "Профил",
    totalLocationsTitle: "Посетили сте 4/4 обекта!",
    totalPoints: "20/20 т. събрани",
    progress: "Вашият прогрес",
    visited: "Посетен",
    notVisited: "Не посетен",
    pointsCollected: "Вие сте събрали 20/20 т.",
    congratulationsText1:
      "Поздравления! Вие събрахте общо 20 точки и може да вземете вашият сертификат!",
    congratulationsText2: "Споделете вашето постижение с приятели!",
    download: "Изтегли",
    p: "т.",
    collectPoints:
      "Съберете общо {{totalPoints}} точки, за да вземете вашият сертификат!",
  },
  scan: {
    codeScanned: "Успешно сканирахте кода",
    codeAlreadyScanned: "Вече сте сканирали този код",
    visitProfile: "Вижте вашите точки и посетени локации",
    text1:
      "Локацията беше успешно сканирана от вас и бяха добавени 5 точки към вашият профил!",
    text2:
      "Ако имате желание може да прочетете повече за локацията Хераклея Синтика ",
    here: "тук",
  },
  scanQr: {
    title: "Как да сканирам код?",
    text1:
      "Трябва да се намирате на локацията и пред вас да се намира обозначеният QR код. За да сканирате QR кода, трябва да използвате камерата на вашия телефон. Насочете камерата към QR кода. След като устройството ви разпознае QR кода, ще ви пренасочи към нашата страница и ще ви покаже информация за това дали успешно сте сканирали QR кода и колко точки сте получили.",
    text2:
      "Пълните правила за точки и награди може да намерите в нашата начална страница под секция 'Точки и Награди'",
    text3:
      "Екипът на ‘ScanSight’ и Община Петрич Ви пожелава успех и приятна игра!",
    button: "Затвори",
  },
};
