import { Stack, Typography } from "@mui/material";

const HomeAbout = () => {
  return (
    <Stack width="100%" maxWidth="1400px" m="0 auto" px={2} py={20} gap={2}>
      <Typography component="h2" variant="h3" mb={2}>
        ScanSight - Вашият Пътеводител към Туристическите Чудеса на Петрич!
      </Typography>

      <Typography component="p" variant="body1">
        Добре дошли в ScanSight - уеб базираното приложение, което превръща
        вашето туристическо приключение в Петрич в истинско предизвикателство и
        източник на вдъхновение! ScanSight обединява уникалната комбинация от
        технология и култура, като ви предоставя възможността да откриете
        забележителностите на град Петрич чрез сканиране на QR кодове.
      </Typography>
      <Typography component="p" variant="body1">
        С нас можете да се отправите на невероятно пътешествие из богатата
        история и природни красоти на Петрич, като едновременно с това спечелите
        точки за всяко сканиране на туристически обект. От древни замъци и
        църкви, през красиви паркове и градски площади, до уникални паметници и
        музеи - ScanSight ви предоставя ключа към разкриването на всички тайни
        на този прекрасен град.
      </Typography>
      <Typography component="p" variant="body1">
        Събирайте точки, изследвайте, наслаждавайте се и се потопете в
        аутентичния дух на Петрич, докато достигате до вашия цел - сертификат от
        община Петрич за вашата посещаемост и любов към този чудесен град. С
        ScanSight, всяко пътешествие е възможност за откриване на нови и
        вълнуващи преживявания. Да започнем вашето приключение днес!
      </Typography>
    </Stack>
  );
};

export default HomeAbout;
