import { Box, Stack, Typography } from "@mui/material";
import CalendarMonthIcon from "@mui/icons-material/CalendarMonth";

const HeracleaSintica = () => {
  return (
    <Stack
      width="100%"
      gap={3}
      px={{ xs: 2, sm: 2, md: 10 }}
      py={{ xs: 4, sm: 4, md: 4 }}
      textAlign="justify"
    >
      <Typography component="h4" variant="h3">
        Светлината на историческите битки, огледалото на тракийското величие.
      </Typography>

      <Box
        sx={{
          width: "100%",
          height: "600px",
          backgroundImage:
            "url('https://ik.imagekit.io/obelussoft/VisitPetrich/%D0%A5%D0%B5%D1%80%D0%B0%D0%BA%D0%BB%D0%B5%D1%8F/%D0%A5%D0%B5%D1%80%D0%B0%D0%BA%D0%BB%D0%B5%D1%8F%20%D0%A1%D0%B8%D0%BD%D1%82%D0%B8%D0%BA%D0%B0%20(1)-min_eDDWNTLPh.jpg?updatedAt=1708357634883')",
          backgroundRepeat: "no-repeat",
          backgroundPosition: "center",
          backgroundSize: "cover",
          borderRadius: "10px",
        }}
      ></Box>

      <Stack mb={2}>
        <Stack
          direction="row"
          justifyContent="flex-start"
          alignItems="center"
          gap={1}
        >
          <CalendarMonthIcon />
          <Typography>Всеки ден от 09:00 до 20:00 ч.</Typography>
        </Stack>
      </Stack>

      <Typography component="p" variant="body1" textAlign="justify">
        Античен град Хераклея Синтика е сред най-значимите археологически обекти
        в България. Градът съществува близо 1000 години, от IVв.пр.Хр. до
        VIв.сл.Хр., като през това време населението и управниците му са
        проявявали завидна адаптивност в динамичната и често променяща се през
        вековете политическа и икономическа картина.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Близо 100 години учените спорят къде се намира той. Очакванията били да
        се локализира в Р.Гърция, в подножието на планината Рупел (дн.Беласица),
        както споменават древните автори. Латински надпис на император Галерий
        от 308г., заловен при полицейска акция срещу иманяри през 2002г., и
        проучен и публикуван от доц.Георги Митрев., показва категорично, че
        Хераклея лежи край Петрич, в местността „Рупите“.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Градът носи името на митичния герой Херакъл (Херкулес), който се смята
        за родоначалник на македонската династия на Аргеадите. Те го основават
        през ІV в. пр. Хр. в племенната територия на траките-синти. Хераклея
        Синтика се превръща в стратегически център в североизточните предели на
        древното македонско царство. По време на управлението на Филип II
        Македонски, Хераклея се превръща в една от македонските кралски
        резиденции. Оттук започват и първите военни кампании на Александър
        Велики. Именно от Хераклея той потегля на поход срещу съседни тракийски
        племена преди да завоюва огромната Персийска империя.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        През 148г.пр.Хр. Хераклея Синтика е присъединен към провинция Македония
        в рамките на Римската империя. Градът е покровителстван от самия
        Октавиан Август – основателят на Римската империя. Именно по време на
        римския си период, II – IIIв.сл.Хр., Хераклея Синтика изживява своя
        най-голям разцвет. Изключителната, като мащаб, качества и художествена
        стойност, архитектура на централната градска част свидетелства за
        просперитета на града.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Огромен римски форум, построен върху старата агора, раннохристиянска
        базилика, гражданска базилика, жилищен и занаятчийски квартал, 15
        верижни сакрални помещения, едно от които се смята за светилище на
        Немезида и най-вече сложната система от отводнителни канали, будят
        възхищение със своя разкош и прецизност на изпълнението, запазили се и
        до днес.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Театралните маски, търговски принадлежности и наличието на множество
        монети от цял свят, са поредното доказателство за богатия културен и
        социално – икономически живот, кипял в Хераклея Синтика.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Две силни земетресения през ІV-V век разрушават столицата на Средна
        Струма, а жителите му продължават да живеят до края на VІ в. сл. Хр. на
        неговия Акропол, разположен върху южния връх на хълма Кожух.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Дебелите пластове руини и тонове свлечена от хълма „Кожух“ пръст пазят
        Хераклея през следващите 1500 години.
      </Typography>
      <Typography component="p" variant="body1" textAlign="justify">
        Днес, и археолози, и туристи са смаяни от отлично съхранените структури,
        които посетителят може да види в автентичен вид с прецизна консервация.
        Теренните проучвания продължават и пред очите на посетителя Хераклея
        Синтика продължава да разкрива тайните си.
      </Typography>

      <iframe
        width="100%"
        height="600"
        scrolling="no"
        src="https://maps.google.com/maps?width=100%25&amp;height=600&amp;hl=en&amp;q=%D0%90%D0%BD%D1%82%D0%B8%D1%87%D0%B5%D0%BD%20%D0%B3%D1%80%D0%B0%D0%B4%20%D0%A5%D0%B5%D1%80%D0%B0%D0%BA%D0%BB%D0%B5%D1%8F%20%D0%A1%D0%B8%D0%BD%D1%82%D0%B8%D0%BA%D0%B0,%202863%20%D0%9F%D0%B5%D1%82%D1%80%D0%B8%D1%87+(My%20Business%20Name)&amp;t=&amp;z=14&amp;ie=UTF8&amp;iwloc=B&amp;output=embed"
        style={{ border: 0 }}
      />
    </Stack>
  );
};

export default HeracleaSintica;
